АлогистикТест2/src/Documents/алк_ПростойОборудования/алк_ПростойОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПростойОборудования</name>
  <registerRecords>AccumulationRegister.алк_УчетПростоев</registerRecords>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Диспетчер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.алк_Цеха</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автозагрузка</name>
    <comment>Признак автоматического создания документа.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <comment>Код события в базе Opti-Monitoring.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПростоя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Участок</name>
      <type>
        <types>CatalogRef.алк_Участки</types>
      </type>
    </attributes>
    <attributes>
      <name>Узел</name>
      <type>
        <types>CatalogRef.алк_УзелУчастка</types>
      </type>
    </attributes>
    <attributes>
      <name>МашинныйЦентр</name>
      <type>
        <types>CatalogRef.алк_МашинныйЦентр</types>
      </type>
    </attributes>
    <attributes>
      <name>Простой</name>
      <type>
        <types>CatalogRef.алк_Простой</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПростоя</name>
      <type>
        <types>CatalogRef.алк_ВидПростоя</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПростоя</name>
      <type>
        <types>CatalogRef.алк_ТипПростоя</types>
      </type>
    </attributes>
    <attributes>
      <name>Служба</name>
      <type>
        <types>CatalogRef.алк_Службы</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>CatalogRef.алк_АналитикаПростоя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ПростойОборудования/Forms/ФормаВводаВремени/Module.bsl
&НаКлиенте
Процедура ПерерисоватьЧасы()

	Ч1 = Цел((Время - Дата('0001.01.01'))/36000);
	Ч2 = Цел((Время - Дата('0001.01.01'))/3600)- Ч1*10;
	
	М = Формат(Время, "ДФ=mm");
	М1 = Лев(М, 1);
	М2 = Прав(М, 1);

КонецПроцедуры

&НаКлиенте
Процедура Плюс1(Команда)
	
	Время = Время + 60; 	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура Плюс10(Команда)
	
	Время = Время + 600; 	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура Плюс60(Команда)
	
	Время = Время + 3600; 	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура Минус1(Команда)
	
	Время = Время - 60; 	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура Минус10(Команда)
	
	Время = Время - 600; 	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура Минус60(Команда)
	
	Время = Время - 3600; 	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПриИзменении(Элемент)
	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВремя(Команда)
	
	ЭтаФорма.Закрыть(Время);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВремяНачала") и Параметры.Свойство("ВремяЗавершения") Тогда
		Если Параметры.ВремяНачала > Параметры.ВремяЗавершения Тогда
			Параметры.ВремяНачала 		= Параметры.ВремяНачала + 8*3600;
			Параметры.ВремяЗавершения 	= Параметры.ВремяЗавершения + 8*3600;	
		КонецЕсли;
		ЭтаФорма.Время = Дата('0001.01.01') + (Параметры.ВремяЗавершения - Параметры.ВремяНачала); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПерерисоватьЧасы();
КонецПроцедуры
